let poketmonData = {
    "headings": [
		"라인1",
		"라인2",
		"라인3",
		"라인4",
		"라인5",
		"라인6",
        "라인7",
        "라인8"
	],
    "data": [
        ['1 로토무','4 거북왕','2 돈크로우','3 가디안','2 킬리아','2 야도란','2 또가스','2 음뱃'],
        ['1 랄토스','1 음뱃','1 랄토스','4 코바르온','3 또도가스','4 코바르온','2 나인테일','4 랜드로스'],
        ['1 포곰곰','1 먹고자','1 메탕','2 또가스','4 테라키온','1 음뱃','2 돈크로우','5 황혼의갈기'],
        ['4 잠만보','1 로토무','5 뮤츠','2 이븐곰','2 이븐곰','2 또가스','4 솔록','4 토네로스'],
        ['1 먹고자','4 이상해꽃','4 메타그로스','2 메탕구','1 포니타','4 메로엣타','2 야도란','1 야돈'],
        ['3 날쌩마','3 야도킹','3 날쌩마','2 이븐곰','3 루카리오','2 루카리오','2 먹고자','1 메탕'],
        ['3 솔록','4 음번','3 로토무','3 이븐곰','2 야도란','1 먹고자','1 니로우','1 로토무'],
        ['4 마나피','2 이븐곰','2 먹고자','1 포니타','5 알세(노말)','3 피카츄','3 타타륜','2 루카리오'],
        ['1 먹고자','1 니로우','3 음번','5 알세(풀)','1 야돈','5 디안시','1 니로우','2 이븐곰'],
        ['3 돈크로우','2 날쌩마','2 로토무','2 돈크로우','1 랄토스','1 식스테일','4 잠만보','2 돈크로우'],
        ['4 솔록','2 킬리아','2 먹고자','2 먹고자','2 돈크로우','2 이븐곰','2 킬리아','3 가디안'],
        ['1 야돈','3 메타그로스','3 나인테일','4 메타그로스','2 메탕구','3 날쌩마','2 먹고자','1 니로우'],
        ['1 니로우','2 야도란','3 타타륜','3 케르디오','1 식스테일','2 루카리오','4 랜드로스','3 야도킹'],
        ['5 새벽의날개','5 황혼의갈기','1 먹고자','1 로토무','4 루카리오','4 볼트로스','3 피카츄','1 식스테일'],
        ['2 먹고자','1 포니타','3 피카츄','1 음뱃','1 랄토스','3 이븐곰','4 케르디오','1 먹고자'],
        ['4 이상해꽃','2 또가스','2 루카리오','1 니로우','4 가디안','1 리오르','1 니로우','2 돈크로우'],
        ['2 돈크로우','4 케르디오','2 또가스','4 잠만보','2 먹고자','1 식스테일','3 로토무','2 먹고자'],
        ['2 나인테일','1 리오르','1 로토무','1 포니타','3 돈크로우','2 야도란','3 야도킹','1 포니타'],
        ['5 뮤','2 돈크로우','1 니로우','2 메탕구','2 또가스','4 잠만보','3 케르디오','2 루카리오'],
        ['4 리자몽','1 포곰곰','2 음뱃','3 피카츄','2 음뱃','2 나인테일','5 제르네아스','2 메탕구'],
        ['2 로토무','2 로토무','3 루카리오','5 뮤','5 알세(물)','2 음뱃','3 솔록','3 타타륜'],
        ['2 킬리아','4 메로엣타','2 야도란','1 식스테일','1 먹고자','3 타타륜','2 돈크로우','2 이븐곰'],
        ['2 날쌩마','2 먹고자','4 코바르온','1 메탕','2 야도란','1 야돈','4 루나톤','2 야도란'],
        ['2 메탕구','2 나인테일','5 알세(불꽃)','2 야도란','2 나인테일','2 먹고자','3 음번','2 날쌩마'],
        ['3 또도가스','2 루카리오','1 음뱃','2 나인테일','1 포니타','4 야도킹','2 로토무','1 포곰곰'],
        ['1 식스테일','3 이븐곰','1 포니타','3 루나톤','1 메탕','1 포니타','2 메탕구','2 나인테일'],
        ['1 랄토스','2 나인테일','4 루카리오','2 음뱃','2 야도란','1 포곰곰','4 루나톤','2 날쌩마'],
        ['2 킬리아','4 메타그로스','1 음뱃','2 킬리아','2 루카리오','4 케르디오','2 날쌩마','4 이상해꽃'],
        ['3 루카리오','5 앤테이','4 마나피','4 볼트로스','3 메타그로스','2 날쌩마','5 새벽의날개','1 리오르'],
        ['2 메탕구','4 랜드로스','4 가디안','4 테라키온','1 메탕','3 메타그로스','1 랄토스','3 솔록'],
        ['2 음뱃','2 또가스','3 솔록','1 리오르','1 로토무','3 로토무','4 야도킹','3 루나톤'],
        ['4 루나톤','1 메탕','1 리오르','1 랄토스','3 피카츄','1 메탕','1 로토무','2 로토무'],
        ['4 야도킹','2 음뱃','2 음뱃','4 메로엣타','5 테오키스','5 실버디','2 루카리오','1 음뱃'],
        ['2 이븐곰','3 나인테일','2 메탕구','1 음뱃','3 가디안','2 메탕구','2 루카리오','5 이벨타르'],
        ['1 음뱃','4 솔록','1 식스테일','2 로토무','1 음뱃','2 또가스','1 야돈','2 킬리아'],
        ['4 비리디온','1 메탕','2 나인테일','2 로토무','1 포곰곰','3 케르디오','1 먹고자','3 피카츄'],
        ['3 또도가스','3 잠만보','1 야돈','1 리오르','4 거북왕','1 로토무','3 루카리오','3 음번'],
        ['2 야도란','1 포곰곰','3 메타그로스','2 루카리오','4 메로엣타','4 루카리오','2 음뱃','4 코바르온'],
        ['2 또가스','4 테라키온','4 테라키온','1 포곰곰','4 토네로스','3 돈크로우','1 메탕','4 가디안'],
        ['3 나인테일','5 테오키스','4 리자몽','5 뮤츠','4 음번','2 킬리아','1 식스테일','1 포곰곰'],
        ['2 먹고자','3 가디안','2 날쌩마','3 음번','2 날쌩마','2 로토무','2 날쌩마','1 리오르'],
        ['1 식스테일','2 메탕구','4 거북왕','2 킬리아','4 마나피','5 레지기가스','1 음뱃','2 또가스'],
        ['1 포니타','1 식스테일','2 킬리아','4 케르디오','2 로토무','1 야돈','5 디안시','1 랄토스'],
        ['5 스이쿤','1 야돈','2 킬리아','4 리자몽','3 루나톤','2 로토무','3 날쌩마','3 또도가스'],
        ['3 이븐곰','3 루나톤','1 포곰곰','1 먹고자','3 로토무','3 잠만보','1 포곰곰','3 돈크로우'],
        ['2 나인테일','2 음뱃','1 야돈','3 나인테일','4 비리디온','1 니로우','1 포니타','4 비리디온'],
        ['1 메탕','1 로토무','4 비리디온','3 잠만보','2 나인테일','1 로토무','1 리오르','4 마나피'],
        ['4 음번','2 이븐곰','2 이븐곰','3 야도킹','1 니로우','2 돈크로우','4 거북왕','4 토네로스'],
        ['2 루카리오','1 랄토스','5 라이코','2 날쌩마','3 잠만보','1 랄토스','4 리자몽','5 레지기가스'],
        ['1 리오르','3 케르디오','1 먹고자','1 야돈','1 리오르','4 이상해꽃','2 이븐곰','4 볼트로스']
    ]
}


window.addEventListener('DOMContentLoaded', event => {
    // Simple-DataTables
    // https://github.com/fiduswriter/Simple-DataTables/wiki

    let options1 = {
        searchable: false,
        sortable: false,
        perPageSelect: false,
        footer : false,
        labels : {
            info: ""
        },
        paging: false
    };

    let options2 = {
        data: poketmonData,
        searchable: false,
        sortable: false,
        perPageSelect: false,
        footer : false,
        labels : {
            info: ""
        },
        paging: false,
        fixedColumns: true,
        fixedHeight:true
    };

    
    const poketmonSelect = document.getElementById('poketmonSelect');
    if (poketmonSelect) {
        new simpleDatatables.DataTable(poketmonSelect, options1);
    }

    const datatablesSimple = document.getElementById('datatablesSimple');
    if (datatablesSimple) {
        new simpleDatatables.DataTable(datatablesSimple, options2);
    }

});
